---
title:  UCDN配置过程
date: 2016-5-31 0:06
tags: 产品说明
---

### 概述 ###
原本的需求是这样的，我本来打算给我的博客套一层cdn的，但是不行。我的博客是放在github page上的，原因可能是github有限制。这个以后再来研究下。后来我干脆改变了思路，配置个加速看看，走走这个过程。了解下配置的细节。我这里配置的过程就是一般加速的配置过程，没有什么特殊的。


### 过程说明 ###
1、控制配置加速域名。一共下面这些框框是要填的，关于各个框中内容的说明参考下面的。提交申请之后大概几十分钟就能配置好，配置好后在在域名供应商那边配置下cname记录就可以通过加速域名访问了。
![CDN配置](http://7xr7kh.com1.z0.glb.clouddn.com/CDN%E5%8A%A0%E9%80%9F%E9%85%8D%E7%BD%AE.png)

- 加速域名，指需要使用cdn加速的域名，比如：example.com，不能以http或者https开头

- 加速区域，目前支持国内和国外加速，默认为国内加速。流量计费模式下，只有购买了国外流量才能选择国外加速区域，带宽计费模式没有限制。

- 测试url，请输入一个文件的url地址，用于测试网址的连通性和可用性，域名要与前面填写的加速域名一致。

- 源站，指创建加速域名对应的ip。支持多个回源ip或者一个回源域名。如果是多个回源ip是以访问最快策略去调用多个ip，如果是回源域名，cdn会先从回源域名获取访问ip，再回源。


2、在控制配置好后还需要在域名供应商那边做一次配置。做cname的过程可以参考下面的配置。注意每个加速的cname都是不一样的。请从您的CDN控制复制CDN域名。![CDN配置](http://7xr7kh.com1.z0.glb.clouddn.com/CDN%E5%9F%9F%E5%90%8D%E9%85%8D%E7%BD%AE.png)


3、验证方法就是通过访问上面的测试连接，看http头部是否是hit的来判断。具体参考这里：https://docs.ucloud.cn/upd-docs/ucdn/faq.html#id3
